{
  "header": {
    "title": "My Projects",
    "subtitle": "Explore my portfolio of production-ready React Native applications. Each project showcases real-world solutions serving thousands of users with advanced features and optimized performance."
  },
  "projects": [
    {
      "title": "Soul33 - Wellness & Meditation App",
      "description": "Led end-to-end development of a comprehensive wellness platform serving 15,000+ users with a 4.7 rating. Architected real-time group chat with 200+ concurrent sessions, voicemail system with audio message replies and file sharing, centralized audio playback with offline progress tracking, and intelligent background downloads. Enhanced performance by 40% through New React Native Architecture implementation and advanced state management.",
      "technologies": [
        "React Native",
        "TypeScript",
        "Redux",
        "WebSocket",
        "AWS S3",
        "react-native-track-player",
        "AsyncStorage",
        "React Navigation",
        "Firebase",
        "React Native Reanimated"
      ],
      "image": "2.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/soul33/id1496751333",
      "playStore": "https://play.google.com/store/apps/details?id=com.ecinfosolutions.soul33",
      "category": "Wellness",
      "stats": {
        "rating": "4.7",
        "users": "15,000+"
      },
      "features": [
        {
          "title": "Real-time Group Chat & Messaging",
          "description": "Advanced WebSocket integration supporting 200+ concurrent sessions with instant messaging, audio message upload/download, reply functionality, read receipts, and message deletion. Features swipe-to-reply gestures and superuser moderation capabilities."
        },
        {
          "title": "Centralized Audio Playback System",
          "description": "Architected robust audio infrastructure using react-native-track-player with global state management, offline progress tracking via AsyncStorage, background playback, intelligent sync on connectivity restore, and memory-safe cleanup on navigation."
        },
        {
          "title": "Intelligent Download Management",
          "description": "Multi-user download system with personalized and normal content categorization, background queue processing, offline storage optimization, and automatic synchronization when returning online."
        },
        {
          "title": "Performance & Architecture Optimization",
          "description": "40% performance improvement through New React Native Architecture implementation, dependency upgrades (react-native-track-player v5), storage migration (MMKV to AsyncStorage), and advanced animation optimization using React Native Reanimated."
        },
        {
          "title": "Cross-Platform UI/UX Excellence",
          "description": "Responsive design for tablet and mobile with consistent theming, skeleton loaders, enhanced empty states with contextual icons, font scaling control, and smooth navigation transitions across meditation, tarot, and wellness screens."
        },
        {
          "title": "Build & Deployment Automation",
          "description": "Managed complete CI/CD pipeline with versioning (Android v12.10+, iOS v3.0+), dependency management, store deployment preparation, and crash resolution for both Apple App Store and Google Play Store."
        }
      ]
    },
    {
      "title": "Yoke App - Social Wellness Platform",
      "description": "Developed an Instagram-like Reels feature with advanced video optimization including preloading, caching, and seamless playback. Integrated live streaming with ZegoCloud SDK enabling recording and real-time audience interaction. Built comprehensive creator profiles with optimized tabs and gallery components. Reduced re-renders by 40% on complex UI screens through component memoization and lazy loading.",
      "technologies": [
        "React Native",
        "Redux",
        "ZegoCloud SDK",
        "react-native-video-cache",
        "Video Streaming"
      ],
      "image": "6.png",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/us/app/yoke-yoga/id6480213431",
      "playStore": "https://play.google.com/store/apps/details?id=com.yoke.yoga",
      "category": "Social",
      "stats": {
        "rating": "4.5",
        "users": "10,000+"
      },
      "features": [
        {
          "title": "Instagram-Style Reels",
          "description": "Smooth vertical scrolling video feed with advanced preloading, intelligent caching, and seamless playback transitions."
        },
        {
          "title": "Live Streaming",
          "description": "Real-time live streaming powered by ZegoCloud SDK with recording capabilities and interactive audience features."
        },
        {
          "title": "Creator Profiles",
          "description": "Comprehensive creator profile pages with optimized tabs, gallery views, and content organization for enhanced user experience."
        },
        {
          "title": "Video Optimization",
          "description": "Advanced video caching and preloading system ensuring smooth playback and minimal buffering across all network conditions."
        },
        {
          "title": "Performance Enhancement",
          "description": "40% reduction in re-renders through strategic component memoization, lazy loading, and React optimization techniques."
        },
        {
          "title": "Real-time Interaction",
          "description": "Live audience interaction features including comments, reactions, and engagement metrics during streaming sessions."
        }
      ]
    },
    {
      "title": "Co-stack Barva - E-commerce & AR Beauty Platform",
      "description": "Led React Native development for comprehensive beauty e-commerce platform with Shopify API integration for 100+ products, cart management, and customer authentication. Architected complete navigation system, UI/UX components, and state management. Implemented Firebase integration for push notifications and crash analytics serving 5k+ users. Enhanced performance through optimized image handling and responsive design.",
      "technologies": [
        "React Native",
        "TypeScript",
        "Redux",
        "Shopify API",
        "Firebase Cloud Messaging",
        "Firebase Crashlytics",
        "react-native-fast-image",
        "react-native-image-zoom-viewer",
        "react-native-video-controls",
        "React Navigation",
        "Formik",
        "Yup"
      ],
      "image": "4.png",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/barva-skin-therapie/id6746832703",
      "playStore": "https://play.google.com/store/apps/details?id=com.barvaskintherapie.app",
      "category": "E-commerce",
      "stats": {
        "rating": "4.6",
        "users": "5,000+"
      },
      "features": [
        {
          "title": "Complete E-commerce Architecture",
          "description": "Built full Shopify integration from ground up - customer authentication, cart management, order processing, and product catalog with 100+ beauty items. Implemented dynamic product fetching, variant mapping, and sold-out product filtering."
        },
        {
          "title": "Advanced Navigation & UI System",
          "description": "Architected complete navigation stack with custom tab bars, responsive headers, and smooth transitions. Created theme-based design system with consistent colors, typography, and reusable components (CustomButton, TextInputField, CustomHeader)."
        },
        {
          "title": "Firebase Integration & Notifications",
          "description": "Implemented Firebase Cloud Messaging for push notifications with token management, foreground/background handling, and permission systems. Integrated Crashlytics for error monitoring and analytics tracking."
        },
        {
          "title": "Enhanced Media & Performance",
          "description": "Optimized media handling with react-native-fast-image for caching, image zoom functionality, YouTube video integration, and responsive image scaling. Improved app performance through memoization and debounced search."
        },
        {
          "title": "User Experience & Responsive Design",
          "description": "Developed responsive layouts for tablet and mobile with dynamic spacing, font scaling, and device detection. Implemented skeleton loaders, empty states, and smooth animations across shopping experience."
        },
        {
          "title": "Build & Deployment Management",
          "description": "Managed complete app lifecycle - versioning, store deployment, dependency upgrades, and configuration for both iOS and Android platforms with optimized build scripts and signing configurations."
        }
      ]
    },
    {
      "title": "Culture Max - Interactive Card Game Platform",
      "description": "Upgraded React Native from 0.72.4 to 0.81.1, migrating Android from Java to Kotlin and iOS AppDelegate to Swift. Implemented monetization system with sponsor cards, banner ads, and reward vouchers, increasing user engagement by 35%. Built advanced card caching system supporting 1,000+ daily active users with real-time analytics for sponsor clicks and view counts.",
      "technologies": [
        "React Native",
        "Redux",
        "Firebase",
        "Kotlin",
        "Swift",
        "AsyncStorage"
      ],
      "image": "1.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/culture-max/id6478849232",
      "playStore": "https://play.google.com/store/apps/details?id=com.culturemaxapk",
      "category": "Gaming",
      "stats": {
        "rating": "4.4",
        "users": "1,000+"
      },
      "features": [
        {
          "title": "Major React Native Upgrade",
          "description": "Successfully upgraded from RN 0.72.4 to 0.81.1 with complete migration of Android codebase from Java to Kotlin and iOS AppDelegate to Swift."
        },
        {
          "title": "Monetization System",
          "description": "Comprehensive revenue system featuring sponsor cards, strategic banner ad placements, and reward vouchers driving 35% increase in user engagement."
        },
        {
          "title": "Advanced Card Caching",
          "description": "Intelligent card caching system optimized for 1,000+ daily active users ensuring instant card loading and smooth gameplay."
        },
        {
          "title": "Real-time Analytics",
          "description": "Built-in analytics dashboard tracking sponsor card clicks, view counts, and user engagement metrics in real-time."
        },
        {
          "title": "Interactive Card Gameplay",
          "description": "Engaging card-based game mechanics with smooth animations, touch interactions, and rewarding user experiences."
        },
        {
          "title": "Firebase Integration",
          "description": "Complete Firebase setup for authentication, database, analytics, and push notifications ensuring robust backend support."
        }
      ]
    },
    {
      "title": "Netra's - Social Commerce Platform",
      "description": "Led complete React Native development of social-commerce platform integrating Shopify Storefront API via GraphQL for full e-commerce functionality. Engineered TikTok-style short-form video feed with preloading and seamless playback. Built comprehensive navigation system with custom tab bars and smooth transitions. Implemented Firebase integration for notifications and crash analytics. Developed rich content systems including blogs, recipes with HTML rendering, and embedded YouTube videos.",
      "technologies": [
        "React Native",
        "TypeScript",
        "Redux Toolkit",
        "Shopify API",
        "GraphQL",
        "Apollo Client",
        "Firebase Cloud Messaging",
        "Firebase Crashlytics",
        "react-native-fast-image",
        "react-native-reanimated",
        "react-native-video",
        "React Navigation",
        "Formik",
        "Yup"
      ],
      "image": "5.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/netras/id6745164461",
      "playStore": "https://play.google.com/store/apps/details?id=com.netras",
      "category": "E-commerce",
      "stats": {
        "rating": "4.5",
        "users": "8,000+"
      },
      "features": [
        {
          "title": "Complete E-commerce Architecture",
          "description": "Built full Shopify integration with GraphQL APIs for customer authentication, cart management, order processing, and product catalog. Implemented secure checkout flows with guest and authenticated user support."
        },
        {
          "title": "Advanced Video Platform",
          "description": "Engineered TikTok-style short-form video feed with intelligent preloading, persistent playback state, and seamless transitions. Developed full-screen video player with gesture controls and optimized buffering for both short and long-form content."
        },
        {
          "title": "Sophisticated Navigation System",
          "description": "Architected complete navigation stack with custom bottom tabs, animated transitions, and nested navigators. Implemented immersive experiences by hiding tabs on video screens and maintaining state across navigation."
        },
        {
          "title": "Rich Content Management",
          "description": "Developed blog and recipe sections with advanced HTML rendering using react-native-render-html, embedded YouTube video extraction, and dynamic content presentation with pagination and loading states."
        },
        {
          "title": "Firebase & Performance Optimization",
          "description": "Integrated Firebase for push notifications, crash analytics, and performance monitoring. Enhanced media handling with FastImage caching, optimized FlatList rendering, and smooth animations using Reanimated."
        },
        {
          "title": "Social Commerce Integration",
          "description": "Built social features including follow/unfollow functionality, like systems, content sharing, and creator channels. Seamlessly blended social engagement with e-commerce for direct product discovery and purchases."
        }
      ]
    },
    {
      "title": "Flairish - Dual-App Learning Marketplace",
      "description": "Led the complete development of Flairish (Hobbyist) and FlairWiz (Instructor) apps - a comprehensive learning platform connecting learners with expert instructors through live video sessions. Architected and implemented the entire mobile ecosystem including Zoom Video SDK integration for real-time sessions, In-App Purchase systems for both iOS and Android, OAuth authentication, and comprehensive session management. Successfully managed 50+ production releases with robust CI/CD pipelines and maintained zero critical bugs in production.",
      "technologies": [
        "React Native",
        "Redux Toolkit",
        "Zoom Video SDK",
        "react-native-iap",
        "Google Sign-In",
        "Apple Sign-In",
        "Firebase",
        "Node.js",
        "AWS S3",
        "WebSocket",
        "FCM",
        "REST APIs"
      ],
      "image": "3.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "category": "Education Technology",
      "stats": {
        "rating": "4.6",
        "users": "12,000+",
        "sessions": "5,000+",
        "releases": "50+",
        "uptime": "99.9%"
      },
      "key_achievements": [
        {
          "metric": "Development Leadership",
          "value": "Led complete mobile development for both Flairish and FlairWiz apps"
        },
        {
          "metric": "Video Integration",
          "value": "Successfully integrated Zoom Video SDK with custom UI and session management"
        },
        {
          "metric": "Payment Systems",
          "value": "Implemented complete In-App Purchase flows for both iOS and Android platforms"
        },
        {
          "metric": "Production Releases",
          "value": "Managed 50+ production releases with zero critical bugs"
        },
        {
          "metric": "User Authentication",
          "value": "Engineered secure OAuth authentication with Google and Apple Sign-In"
        }
      ],
      "features": [
        {
          "title": "Dual-App Architecture",
          "description": "Built two interconnected React Native applications - Flairish for learners seeking skills and FlairWiz for instructors offering expertise, creating a complete learning marketplace ecosystem with shared backend services."
        },
        {
          "title": "Real-Time Video Sessions",
          "description": "Integrated Zoom Video SDK for seamless live video sessions with custom UI controls, screen sharing, participant management, and comprehensive session lifecycle handling including join/leave events and session timing."
        },
        {
          "title": "Cross-Platform In-App Purchases",
          "description": "Implemented complete IAP solution using react-native-iap with secure transaction verification, receipt validation, purchase tracking, and subscription management for both iOS App Store and Google Play Store."
        },
        {
          "title": "Secure Authentication System",
          "description": "Developed OAuth integration with Google and Apple Sign-In, including token management, user profile synchronization, and secure session handling with proper error handling and user feedback mechanisms."
        },
        {
          "title": "Advanced Session Management",
          "description": "Created comprehensive booking system with scheduling, availability management, session reminders, notifications, rescheduling capabilities, and detailed session history for both students and instructors."
        },
        {
          "title": "Production-Grade Deployment",
          "description": "Established robust CI/CD pipelines, managed app store submissions, implemented crash reporting with Firebase, and maintained high code quality with comprehensive testing and monitoring systems."
        },
        {
          "title": "Media Management",
          "description": "Built advanced media handling system with AWS S3 integration for image/video uploads, thumbnail generation, content compression, and efficient media delivery with progress tracking and error handling."
        },
        {
          "title": "Real-time Communication",
          "description": "Implemented WebSocket-based chat system with message delivery status, typing indicators, push notifications, and offline message synchronization for seamless user communication."
        }
      ],
      "development_timeline": {
        "start_date": "2023",
        "status": "Active Development",
        "last_release": "October 2024",
        "team_size": "Full-stack Mobile Developer"
      }
    }
  ]
}
