{
  "header": {
    "title": "My Projects",
    "subtitle": "Explore my portfolio of production-ready React Native applications. Each project showcases real-world solutions serving thousands of users with advanced features and optimized performance."
  },
  "projects": [
    {
      "title": "Soul33 - Wellness & Meditation App",
      "description": "Led end-to-end development of a comprehensive wellness platform serving 15,000+ users with a 4.7 rating. Architected real-time group chat with 200+ concurrent sessions, voicemail system with audio message replies and file sharing, centralized audio playback with offline progress tracking, and intelligent background downloads. Enhanced performance by 40% through New React Native Architecture implementation and advanced state management.",
      "technologies": [
        "React Native",
        "TypeScript",
        "Redux",
        "WebSocket",
        "AWS S3",
        "react-native-track-player",
        "AsyncStorage",
        "React Navigation",
        "Firebase",
        "React Native Reanimated"
      ],
      "image": "2.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/soul33/id1496751333",
      "playStore": "https://play.google.com/store/apps/details?id=com.ecinfosolutions.soul33",
      "category": "Wellness",
      "stats": {
        "rating": "4.7",
        "users": "15,000+"
      },
      "features": [
        {
          "title": "Real-time Group Chat & Messaging",
          "description": "Advanced WebSocket integration supporting 200+ concurrent sessions with instant messaging, audio message upload/download, reply functionality, read receipts, and message deletion. Features swipe-to-reply gestures and superuser moderation capabilities."
        },
        {
          "title": "Centralized Audio Playback System",
          "description": "Architected robust audio infrastructure using react-native-track-player with global state management, offline progress tracking via AsyncStorage, background playback, intelligent sync on connectivity restore, and memory-safe cleanup on navigation."
        },
        {
          "title": "Intelligent Download Management",
          "description": "Multi-user download system with personalized and normal content categorization, background queue processing, offline storage optimization, and automatic synchronization when returning online."
        },
        {
          "title": "Performance & Architecture Optimization",
          "description": "40% performance improvement through New React Native Architecture implementation, dependency upgrades (react-native-track-player v5), storage migration (MMKV to AsyncStorage), and advanced animation optimization using React Native Reanimated."
        },
        {
          "title": "Cross-Platform UI/UX Excellence",
          "description": "Responsive design for tablet and mobile with consistent theming, skeleton loaders, enhanced empty states with contextual icons, font scaling control, and smooth navigation transitions across meditation, tarot, and wellness screens."
        },
        {
          "title": "Build & Deployment Automation",
          "description": "Managed complete CI/CD pipeline with versioning (Android v12.10+, iOS v3.0+), dependency management, store deployment preparation, and crash resolution for both Apple App Store and Google Play Store."
        }
      ]
    },
    {
      "title": "Yoke App - Social Wellness Platform",
      "description": "Developed an Instagram-like Reels feature with advanced video optimization including preloading, caching, and seamless playback. Integrated live streaming with ZegoCloud SDK enabling recording and real-time audience interaction. Built comprehensive creator profiles with optimized tabs and gallery components. Reduced re-renders by 40% on complex UI screens through component memoization and lazy loading.",
      "technologies": [
        "React Native",
        "Redux",
        "ZegoCloud SDK",
        "react-native-video-cache",
        "Video Streaming"
      ],
      "image": "6.png",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/us/app/yoke-yoga/id6480213431",
      "playStore": "https://play.google.com/store/apps/details?id=com.yoke.yoga",
      "category": "Social",
      "stats": {
        "rating": "4.5",
        "users": "10,000+"
      },
      "features": [
        {
          "title": "Instagram-Style Reels",
          "description": "Smooth vertical scrolling video feed with advanced preloading, intelligent caching, and seamless playback transitions."
        },
        {
          "title": "Live Streaming",
          "description": "Real-time live streaming powered by ZegoCloud SDK with recording capabilities and interactive audience features."
        },
        {
          "title": "Creator Profiles",
          "description": "Comprehensive creator profile pages with optimized tabs, gallery views, and content organization for enhanced user experience."
        },
        {
          "title": "Video Optimization",
          "description": "Advanced video caching and preloading system ensuring smooth playback and minimal buffering across all network conditions."
        },
        {
          "title": "Performance Enhancement",
          "description": "40% reduction in re-renders through strategic component memoization, lazy loading, and React optimization techniques."
        },
        {
          "title": "Real-time Interaction",
          "description": "Live audience interaction features including comments, reactions, and engagement metrics during streaming sessions."
        }
      ]
    },
    {
      "title": "Co-stack Barva - E-commerce & AR Beauty Platform",
      "description": "Developed full-scale e-commerce platform with Shopify API integration for products, cart, authentication, and order management supporting 100+ beauty products. Implemented AR-powered lipstick try-on using Three.js and MediaPipe Face Landmarker for real-time virtual makeup experiences. Built notification system with Firebase Cloud Messaging for 5k+ users.",
      "technologies": [
        "React Native",
        "Redux",
        "Shopify API",
        "Three.js",
        "MediaPipe",
        "Firebase",
        "react-native-fast-image"
      ],
      "image": "4.png",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/barva-skin-therapie/id6746832703",
      "playStore": "https://play.google.com/store/apps/details?id=com.barvaskintherapie.app",
      "category": "E-commerce",
      "stats": {
        "rating": "4.6",
        "users": "5,000+"
      },
      "features": [
        {
          "title": "Shopify E-commerce Integration",
          "description": "Complete e-commerce functionality with product catalog, shopping cart, secure authentication, and order management for 100+ beauty products."
        },
        {
          "title": "AR Lipstick Try-On",
          "description": "Revolutionary AR-powered virtual makeup experience using Three.js and MediaPipe Face Landmarker for real-time lipstick visualization."
        },
        {
          "title": "Firebase Push Notifications",
          "description": "Comprehensive notification system with Firebase Cloud Messaging delivering personalized updates to 5,000+ active users."
        },
        {
          "title": "Product Catalog Management",
          "description": "Intuitive product browsing with advanced filtering, search functionality, and detailed product information pages."
        },
        {
          "title": "Secure Payment Processing",
          "description": "Integrated Shopify payment gateway with secure checkout process and multiple payment method support."
        },
        {
          "title": "Performance Optimization",
          "description": "Fast image loading with react-native-fast-image and optimized rendering for smooth shopping experience."
        }
      ]
    },
    {
      "title": "Culture Max - Interactive Card Game Platform",
      "description": "Upgraded React Native from 0.72.4 to 0.81.1, migrating Android from Java to Kotlin and iOS AppDelegate to Swift. Implemented monetization system with sponsor cards, banner ads, and reward vouchers, increasing user engagement by 35%. Built advanced card caching system supporting 1,000+ daily active users with real-time analytics for sponsor clicks and view counts.",
      "technologies": [
        "React Native",
        "Redux",
        "Firebase",
        "Kotlin",
        "Swift",
        "AsyncStorage"
      ],
      "image": "1.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/culture-max/id6478849232",
      "playStore": "https://play.google.com/store/apps/details?id=com.culturemaxapk",
      "category": "Gaming",
      "stats": {
        "rating": "4.4",
        "users": "1,000+"
      },
      "features": [
        {
          "title": "Major React Native Upgrade",
          "description": "Successfully upgraded from RN 0.72.4 to 0.81.1 with complete migration of Android codebase from Java to Kotlin and iOS AppDelegate to Swift."
        },
        {
          "title": "Monetization System",
          "description": "Comprehensive revenue system featuring sponsor cards, strategic banner ad placements, and reward vouchers driving 35% increase in user engagement."
        },
        {
          "title": "Advanced Card Caching",
          "description": "Intelligent card caching system optimized for 1,000+ daily active users ensuring instant card loading and smooth gameplay."
        },
        {
          "title": "Real-time Analytics",
          "description": "Built-in analytics dashboard tracking sponsor card clicks, view counts, and user engagement metrics in real-time."
        },
        {
          "title": "Interactive Card Gameplay",
          "description": "Engaging card-based game mechanics with smooth animations, touch interactions, and rewarding user experiences."
        },
        {
          "title": "Firebase Integration",
          "description": "Complete Firebase setup for authentication, database, analytics, and push notifications ensuring robust backend support."
        }
      ]
    },
    {
      "title": "Netra's - Social Commerce Platform",
      "description": "Developed social-commerce app integrating Shopify Storefront API via GraphQL for complete e-commerce functionality including products, cart, checkout, and order management. Engineered TikTok-style short-form video feed with preloading and seamless playback state persistence. Built long-form video player with immersive full-screen experience. Implemented blog and recipe sections with rich HTML rendering and embedded YouTube videos. Enhanced performance with FastImage for cached media loading and Reanimated for smooth transitions.",
      "technologies": [
        "React Native",
        "Redux Toolkit",
        "Shopify API",
        "GraphQL",
        "Apollo Client",
        "react-native-fast-image",
        "react-native-reanimated"
      ],
      "image": "5.jpg",
      "demoVideo": "",
      "github": "https://github.com/Neelesh-FS-Dev",
      "appStore": "https://apps.apple.com/in/app/netras/id6745164461",
      "playStore": "https://play.google.com/store/apps/details?id=com.netras",
      "category": "E-commerce",
      "stats": {
        "rating": "4.5",
        "users": "8,000+"
      },
      "features": [
        {
          "title": "GraphQL Shopify Integration",
          "description": "Complete Shopify Storefront API integration using GraphQL and Apollo Client for products, cart management, secure checkout, and order tracking."
        },
        {
          "title": "TikTok-Style Video Feed",
          "description": "Addictive short-form video feed with intelligent preloading, smooth scrolling, and persistent playback state for seamless user experience."
        },
        {
          "title": "Full-Screen Video Player",
          "description": "Immersive long-form video player with full-screen capabilities, gesture controls, and optimized buffering for quality viewing."
        },
        {
          "title": "Content Management System",
          "description": "Rich blog and recipe sections with HTML rendering, embedded YouTube videos, and engaging content presentation."
        },
        {
          "title": "Performance Optimization",
          "description": "Enhanced app performance using FastImage for intelligent media caching and Reanimated for buttery-smooth transitions and animations."
        },
        {
          "title": "Social Commerce Features",
          "description": "Unique blend of social media engagement and e-commerce functionality enabling direct product purchases from video content."
        }
      ]
    },
    {
      "title": "Flairish - Dual-App Learning Marketplace",
      "description": "Architected and developed two interconnected apps: Flairish (Hobbyist) and FlairWiz (Instructor), connecting learners with instructors through live video sessions. Integrated Zoom Video SDK for real-time video sessions with custom UI and session lifecycle management. Implemented complete In-App Purchase flows for iOS and Android using react-native-iap with transaction verification. Engineered OAuth authentication with Google and Apple Sign-In. Managed 50+ production releases across both platforms.",
      "technologies": [
        "React Native",
        "Redux Toolkit",
        "Zoom Video SDK",
        "react-native-iap",
        "Google Sign-In",
        "Apple Sign-In",
        "Firebase"
      ],
      "image": "3.jpg",
      "demoVideo": "https://www.youtube.com/embed/YOUR_FLAIRISH_VIDEO_ID",
      "github": "https://github.com/Neelesh-FS-Dev",
      "category": "Education",
      "stats": {
        "rating": "4.6",
        "users": "12,000+"
      },
      "features": [
        {
          "title": "Dual-App Architecture",
          "description": "Two interconnected applications - Flairish for learners and FlairWiz for instructors - creating a complete learning marketplace ecosystem."
        },
        {
          "title": "Zoom Video Integration",
          "description": "Seamless real-time video sessions powered by Zoom Video SDK with custom UI, session controls, and comprehensive lifecycle management."
        },
        {
          "title": "In-App Purchases",
          "description": "Complete IAP implementation for both iOS and Android using react-native-iap with secure transaction verification and receipt validation."
        },
        {
          "title": "OAuth Authentication",
          "description": "Streamlined user onboarding with Google and Apple Sign-In integration ensuring secure and convenient authentication."
        },
        {
          "title": "Session Management",
          "description": "Advanced booking system with scheduling, notifications, reminders, and session history for both students and instructors."
        },
        {
          "title": "Production Excellence",
          "description": "Successfully managed 50+ production releases across both apps with comprehensive testing, CI/CD pipelines, and zero critical bugs."
        }
      ]
    }
  ]
}
